In [1]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [2]:
cast = pd.read_csv('cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [3]:
release_dates = pd.read_csv('release_dates.csv', index_col=None, parse_dates=['date'], infer_datetime_format=True)
release_dates.head()

                    title  year      country       date
0   #73, Shaanthi Nivaasa  2007        India 2007-06-15
1                 #Beings  2015      Romania 2015-01-29
2               #Declimax  2018  Netherlands 2018-01-21
3  #Ewankosau saranghaeyo  2015  Philippines 2015-01-21
4                 #Horror  2015          USA 2015-11-20

### Count the number of movies with "Christmas" in their title for each month, that is released are the USA.

In [39]:
release_dates[(release_dates.title.str.contains('Christmas')) & (release_dates.country == 'USA')].date.dt.month.value_counts().sort_index()

1      2
2      2
4      1
5      1
6      1
7      1
8      2
9      2
10    14
11    38
12    47
Name: date, dtype: int64

### Count the number of movies with "Christmas" in their title for each month, that are released in Canada.

In [40]:
release_dates[(release_dates.title.str.contains('Christmas')) & (release_dates.country == 'Canada')].date.dt.month.value_counts().sort_index()

10    2
11    9
12    6
Name: date, dtype: int64

### Count the number of movies in which the titles start with "The Hobbit" for each month, that are released in the USA.

In [52]:
release_dates[(release_dates.title.str.startswith('The Hobbit')) & (release_dates.country == 'USA')].date.dt.month.value_counts().sort_index()

12    3
Name: date, dtype: int64

### Count the number of movies with "Romance" in their title for **each day of the week**, that are released in the USA.

In [58]:
release_dates[(release_dates.title.str.contains('Romance')) & (release_dates.country == 'USA')].date.dt.dayofweek.value_counts().sort_index()

0    21
1     4
2    11
3     6
4    18
5     8
6    32
Name: date, dtype: int64

### Count the number of movies with "Action" in their title for **each day of the week**, that are released in the USA.

In [68]:
release_dates[(release_dates.title.str.contains('Action')) & (release_dates.country == 'USA')].date.dt.dayofweek.value_counts().sort_index()

0     2
1     1
2     3
3     1
4    19
5     2
6     3
Name: date, dtype: int64

### On which date was each Judi Dench movie from the 1990s released in the USA?

In [88]:
judi = cast[(cast.name == 'Judi Dench') & (cast.year // 10 == 199)]
release_dates[release_dates.country == 'USA'].merge(judi).sort_values('date')

,title,year,country,date,name,type,character,n
0,GoldenEye,1995,USA,1995-11-17,Judi Dench,actress,M,6.0
2,Jack & Sarah,1995,USA,1996-03-22,Judi Dench,actress,Margaret,3.0
1,Hamlet,1996,USA,1996-12-25,Judi Dench,actress,Hecuba,12.0
3,Mrs Brown,1997,USA,1997-10-03,Judi Dench,actress,Queen Victoria,1.0
7,Tomorrow Never Dies,1997,USA,1997-12-19,Judi Dench,actress,M,9.0
4,Shakespeare in Love,1998,USA,1999-01-08,Judi Dench,actress,Queen Elizabeth,12.0
5,Tea with Mussolini,1999,USA,1999-05-14,Judi Dench,actress,Arabella,2.0
6,The World Is Not Enough,1999,USA,1999-11-19,Judi Dench,actress,M,6.0

### In which months do films with the actress Judi Dench tend to be released in the USA?

In [96]:
judi = cast[cast.name == 'Judi Dench']
release_dates[release_dates.country == 'USA'].merge(judi).date.dt.month.value_counts().sort_values(ascending = False)

11    12
1      4
2      4
5      4
12     4
3      3
6      3
4      2
9      2
7      1
8      1
10     1
Name: date, dtype: int64

### In which months do films with the actor Tom Cruise tend to be released in the USA?

In [101]:
tc = cast[cast.name == 'Tom Cruise']
release_dates[release_dates.country == 'USA'].merge(tc).date.dt.month.value_counts().sort_values(ascending = False)

12    10
6      8
7      7
5      5
4      3
8      3
10     3
11     3
1      2
3      1
9      1
Name: date, dtype: int64